app/controllers/friends_controller.rb

  def index
    @friends = Friend.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  `friends`.* FROM `friends` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `friends`

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO `friends` (`name`, `address`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('Toti Cavalcanti', 'Av. Pasteur 214/909, Botafogo', 'toticavalcanti@gmail.com', '(21)988714006', '2017-05-25 18:01:24', '2017-05-25 18:01:24')

    def set_friend
      @friend = Friend.find(params[:id])
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 1 LIMIT 1